Revit 2024 API
GroupTypeId.StructuralAnalysis Property
 Structural Analysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId StructuralAnalysis { get; }
Visual Basic
Public Shared ReadOnly Property StructuralAnalysis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralAnalysis {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace